TradeDemoBase/src/Documents/Поступление/Поступление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поступление</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TradeDemoBase/src/Documents/Поступление/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	Строка = Элементы.СписокТоваров.ТекущиеДанные;
	Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
    Строка = Элементы.СписокТоваров.ТекущиеДанные;
    Строка.Сумма = Строка.Количество * Строка.Цена;
КонецПроцедуры
